Autodesk.Revit.DB.StringParameterValue.Value
The stored value
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2016 Subscription Update

Autodesk.Revit.DB.StringParameterValue.#ctor(System.String)
Value constructor
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2016 Subscription Update

Autodesk.Revit.DB.StringParameterValue.#ctor
Default constructor
Since:
2016 Subscription Update

Autodesk.Revit.DB.StringParameterValue
A class that holds a String value of a parameter element.
Since:
2016 Subscription Update